midterm.org
#+PROPERTY: engine mysql

The solutions are based on the extended datasets from the textbook web site.

* Add mysql to PATH

#+BEGIN_SRC emacs-lisp
  (setenv "PATH" (concat "/opt/local/lib/mysql55/bin:"
                         (getenv "PATH")))
#+END_SRC

#+RESULTS:
: /opt/local/lib/mysql55/bin:/opt/local/bin:/opt/local/sbin:/opt/local/Library/Frameworks/Python.framework/Versions/2.6/bin:/opt/local/bin:/opt/local/sbin:/Library/Frameworks/GDAL.framework/Programs:/opt/local/bin:/opt/local/sbin:/usr/bin:/bin:/usr/sbin:/sbin:/usr/local/bin:/usr/X11/bin:/usr/local/git/bin:/usr/texbin:/usr/local/git/bin:/opt/local/lib/postgresql83/bin:/Users/nbest/bin


* Load sample data sets

#+BEGIN_SRC sh
  which mysql
#+END_SRC

#+RESULTS:
: /opt/local/lib/mysql55/bin/mysql

#+BEGIN_SRC sql
-- ZAGI
DROP TABLE soldvia; 
DROP TABLE salestransaction; 
DROP TABLE store; 
DROP TABLE product; 
DROP TABLE vendor; 
DROP TABLE region; 
DROP TABLE category; 
DROP TABLE customer; 
-- HAFH
DROP TABLE cleaning; 
DROP TABLE staffmember; 
DROP TABLE apartment; 
DROP TABLE corpclient; 
DROP TABLE inspecting; 
DROP TABLE inspector; 
DROP TABLE managerphone; 
DROP TABLE advising;
DROP TABLE building;
DROP TABLE employee;
DROP TABLE manager;
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results silent
  # mysql < examples/HAFH\ schema.sql
  # mysql < examples/HAFH\ insert.sql
  mysql < examples/ZAGI\ schema.sql
  # mysql < examples/ZAGI\ insert.sql
#+END_SRC


* Download and insert the expanded data sets

#+BEGIN_SRC sh :results output
  wget --no-verbose \
      http://dbtextbook.com/downloads/HAFHMOREINSERTINTOstatementsMySQL.txt \
      -O examples/ZAGIMORE\ insert.sql 
  wget --no-verbose \
      http://dbtextbook.com/downloads/ZAGIMOREINSERTINTOstatementsMySQL.txt \
      -O examples/HAFHMORE\ insert.sql
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results output
  mysql < examples/HAFHMORE\ insert.sql
  mysql < examples/ZAGIMORE\ insert.sql
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sql :engine mysql
  show tables;
#+END_SRC

#+RESULTS:
| Tables_in_instructorDB |
|------------------------|
| apartment              |
| building               |
| category               |
| cleaning               |
| corpclient             |
| customer               |
| inspecting             |
| inspector              |
| manager                |
| managerphone           |
| product                |
| region                 |
| salestransaction       |
| soldvia                |
| staffmember            |
| store                  |
| vendor                 |


* Problem 3

Consider the ER diagram and relational schema for the ZAGI Retail
Company Sales Department in Figures 5.1a and 5.1b on pages 130 and 131
in your text.  Write the SQL queries that accomplish the following
tasks:


** Part 1

Display the RegionID, RegionName, and number of stores in the region
for all regions.  Sort the results by number of stores from greatest
to least.  (10 points)

/This is exercise 5.1h from the text with an additional requirement
to sort the results./

#+BEGIN_SRC sql :engine mysql
SELECT r.regionid, r.regionname, count(*)
FROM region r, store s
WHERE r.regionid = s.regionid
GROUP BY r.regionid, r.regionname
ORDER BY count(*) DESC;
#+END_SRC

#+RESULTS:
| regionid | regionname  | count(*) |
|----------+-------------+----------|
| C        | Chicagoland |        4 |
| T        | Tristate    |        4 |
| I        | Indiana     |        3 |
| N        | North       |        3 |



*** Alternative 1

#+BEGIN_SRC sql
SELECT r.regionid,r.regionname, count(s.storeid)
FROM region r
INNER JOIN store s
ON r.regionid = s.regionid
GROUP BY r.regionid
ORDER BY count(s.storeid) DESC;
#+END_SRC

#+RESULTS:
| regionid | regionname  | count(s.storeid) |
|----------+-------------+------------------|
| T        | Tristate    |                4 |
| C        | Chicagoland |                4 |
| N        | North       |                3 |
| I        | Indiana     |                3 |

*** Alternative 2

#+BEGIN_SRC sql
SELECT region.regionid, region.regionname, count(*) AS storecount
FROM region
INNER JOIN store
ON store.regionid = region.regionid
GROUP BY regionid
ORDER BY storecount DESC;
#+END_SRC

#+RESULTS:
| regionid | regionname  | storecount |
|----------+-------------+------------|
| C        | Chicagoland |          4 |
| T        | Tristate    |          4 |
| I        | Indiana     |          3 |
| N        | North       |          3 |

#+BEGIN_EXAMPLE
  ERROR 1052 (23000) at line 1: Column 'regionid' in field list is ambiguous
#+END_EXAMPLE

*** Alternative 3

#+BEGIN_SRC sql
SELECT region.regionid, region.regionname, count(*)
FROM region
LEFT OUTER JOIN store
ON store.regionid = region.regionid
GROUP BY region.regionid
ORDER BY count(*) DESC;
#+END_SRC

#+RESULTS:
| regionid | regionname  | count(*) |
|----------+-------------+----------|
| T        | Tristate    |        4 |
| C        | Chicagoland |        4 |
| N        | North       |        3 |
| I        | Indiana     |        3 |


*** cartesian, no WHERE

#+BEGIN_SRC sql :engine mysql
SELECT r.regionid, r.regionname, count(storeid)
FROM region r, store s
-- WHERE r.regionid = s.regionid
GROUP BY r.regionid
ORDER BY count( storeid) DESC;
#+END_SRC

#+RESULTS:
| regionid | regionname  | count(storeid) |
|----------+-------------+----------------|
| I        | Indiana     |             14 |
| N        | North       |             14 |
| T        | Tristate    |             14 |
| C        | Chicagoland |             14 |


** Part 2

Display the ProductID and ProductName of the cheapest product.  
(5 points)

/This is exercise 5.1l from the text./

#+BEGIN_SRC sql
SELECT productid, productname
FROM product
WHERE productprice = (
  SELECT MIN(productprice) FROM product);
#+END_SRC

#+RESULTS:
| productid | productname |
|-----------+-------------|
|       3X3 | Cosy Sock   |


