public_html/midterm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2013-05-22 Wed 22:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Neil Best"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Download and insert the expanded data sets</a></li>
<li><a href="#sec-2">Problem 3</a>
<ul>
<li><a href="#sec-2-1">Part 1</a>
<ul>
<li><a href="#sec-2-1-1">Alternative 1</a></li>
<li><a href="#sec-2-1-2">Alternative 2</a></li>
<li><a href="#sec-2-1-3">Alternative 3</a></li>
</ul>
</li>
<li><a href="#sec-2-2">Part 2</a></li>
<li><a href="#sec-2-3">Part 3</a>
<ul>
<li><a href="#sec-2-3-1">ALternative 1</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">Problem 4</a>
<ul>
<li><a href="#sec-3-1">Part 1</a>
<ul>
<li><a href="#sec-3-1-1">Alternative 1</a></li>
<li><a href="#sec-3-1-2">Alternative 2</a></li>
<li><a href="#sec-3-1-3">Alternative 3</a></li>
<li><a href="#sec-3-1-4">Alternative 4</a></li>
</ul>
</li>
<li><a href="#sec-3-2">Part 2</a>
<ul>
<li><a href="#sec-3-2-1">Alternative 1</a></li>
<li><a href="#sec-3-2-2">Alternative 2</a></li>
<li><a href="#sec-3-2-3">Alternative 3</a></li>
<li><a href="#sec-3-2-4">Alternative 4</a></li>
<li><a href="#sec-3-2-5">Alternative 5</a></li>
<li><a href="#sec-3-2-6">Alternative 6</a></li>
<li><a href="#sec-3-2-7">Alternative 7 &#x2013; not quite right!</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The solutions are based on the extended datasets from the textbook web site.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Download and insert the expanded data sets</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sh">wget --no-verbose \
    http://dbtextbook.com/downloads/HAFHMOREINSERTINTOstatementsMySQL.txt \
    -O examples/ZAGIMORE\ insert.sql 
wget --no-verbose \
    http://dbtextbook.com/downloads/ZAGIMOREINSERTINTOstatementsMySQL.txt \
    -O examples/HAFHMORE\ insert.sql
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">mysql &lt; examples/HAFHMORE\ insert.sql
mysql &lt; examples/ZAGIMORE\ insert.sql
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql">show tables;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Tables_in_instructorDB</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">apartment</td>
</tr>

<tr>
<td class="left">building</td>
</tr>

<tr>
<td class="left">category</td>
</tr>

<tr>
<td class="left">cleaning</td>
</tr>

<tr>
<td class="left">corpclient</td>
</tr>

<tr>
<td class="left">customer</td>
</tr>

<tr>
<td class="left">inspecting</td>
</tr>

<tr>
<td class="left">inspector</td>
</tr>

<tr>
<td class="left">manager</td>
</tr>

<tr>
<td class="left">managerphone</td>
</tr>

<tr>
<td class="left">product</td>
</tr>

<tr>
<td class="left">region</td>
</tr>

<tr>
<td class="left">salestransaction</td>
</tr>

<tr>
<td class="left">soldvia</td>
</tr>

<tr>
<td class="left">staffmember</td>
</tr>

<tr>
<td class="left">store</td>
</tr>

<tr>
<td class="left">vendor</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Problem 3</h2>
<div class="outline-text-2" id="text-2">
<p>
Consider the ER diagram and relational schema for the ZAGI Retail
Company Sales Department in Figures 5.1a and 5.1b on pages 130 and 131
in your text.  Write the SQL queries that accomplish the following
tasks:
</p>
</div>


<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Part 1</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Display the RegionID, RegionName, and number of stores in the region
for all regions.  Sort the results by number of stores from greatest
to least.  (10 points)
</p>

<p>
<i>This is exercise 5.1h from the text with an additional requirement
to sort the results.</i>
</p>

<div class="org-src-container">

<pre class="src src-sql">SELECT r.regionid, r.regionname, count(*)
FROM region r, store s
WHERE r.regionid = s.regionid
GROUP BY r.regionid, r.regionname
ORDER BY count(*) DESC;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">regionid</th>
<th scope="col" class="left">regionname</th>
<th scope="col" class="right">count(*)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C</td>
<td class="left">Chicagoland</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">T</td>
<td class="left">Tristate</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">I</td>
<td class="left">Indiana</td>
<td class="right">3</td>
</tr>

<tr>
<td class="left">N</td>
<td class="left">North</td>
<td class="right">3</td>
</tr>
</tbody>
</table>
</div>



<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">Alternative 1</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-sql">SELECT r.regionid,r.regionname, count(s.storeid)
FROM region r
INNER JOIN store s
ON r.regionid = s.regionid
GROUP BY r.regionid
ORDER BY count(s.storeid) DESC;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">regionid</th>
<th scope="col" class="left">regionname</th>
<th scope="col" class="right">count(s.storeid)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">T</td>
<td class="left">Tristate</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">C</td>
<td class="left">Chicagoland</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">N</td>
<td class="left">North</td>
<td class="right">3</td>
</tr>

<tr>
<td class="left">I</td>
<td class="left">Indiana</td>
<td class="right">3</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">Alternative 2</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-sql">SELECT region.regionid, region.regionname, count(*) AS storecount
FROM region
INNER JOIN store
ON store.regionid = region.regionid
GROUP BY regionid
ORDER BY storecount DESC;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">regionid</th>
<th scope="col" class="left">regionname</th>
<th scope="col" class="right">storecount</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C</td>
<td class="left">Chicagoland</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">T</td>
<td class="left">Tristate</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">I</td>
<td class="left">Indiana</td>
<td class="right">3</td>
</tr>

<tr>
<td class="left">N</td>
<td class="left">North</td>
<td class="right">3</td>
</tr>
</tbody>
</table>

<pre class="example">
ERROR 1052 (23000) at line 1: Column 'regionid' in field list is ambiguous
</pre>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3">Alternative 3</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">

<pre class="src src-sql">SELECT region.regionid, region.regionname, count(*)
FROM region
LEFT OUTER JOIN store
ON store.regionid = region.regionid
GROUP BY region.regionid
ORDER BY count(*) DESC;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">regionid</th>
<th scope="col" class="left">regionname</th>
<th scope="col" class="right">count(*)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">T</td>
<td class="left">Tristate</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">C</td>
<td class="left">Chicagoland</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">N</td>
<td class="left">North</td>
<td class="right">3</td>
</tr>

<tr>
<td class="left">I</td>
<td class="left">Indiana</td>
<td class="right">3</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Part 2</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Display the ProductID and ProductName of the cheapest product.  
(5 points)
</p>

<p>
<i>This is exercise 5.1l from the text.</i>
</p>

<div class="org-src-container">

<pre class="src src-sql">SELECT productid, productname
FROM product
WHERE productprice = (
  SELECT MIN(productprice) FROM product);
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="right"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="right">productid</th>
<th scope="col" class="left">productname</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">3X3</td>
<td class="left">Cosy Sock</td>
</tr>
</tbody>
</table>
</div>
</div>
