midterm.org
** Part 3

Rewrite Query 29 on page 147 using a join statement (no nested
queries).  
(10 points)

/This is exercise 5.1o from the textbook./

The query text:

/For each product that has more than three items sold within all sales
transactions, retrieve the product ID, product name and product price./

The original query and its results:

#+BEGIN_SRC sql
SELECT productid, productname, productprice 
FROM product 
WHERE productid IN (
  SELECT productid 
  FROM soldvia 
  GROUP BY productid 
  HAVING SUM(noofitems) > 3); 
#+END_SRC

#+RESULTS:
| productid | productname            | productprice |
|-----------+------------------------+--------------|
|       1X2 | Comfy Harness          |       150.00 |
|       1X4 | Safe-T Helmet          |        40.00 |
|       2X1 | Mmm Stove              |        80.00 |
|       2X2 | Easy Boot              |        70.00 |
|       2X3 | Reflect-o Jacket       |        35.00 |
|       2X4 | Strongster Carribeaner |        20.00 |
|       3X1 | Sleepy Pad             |        25.00 |
|       3X3 | Cosy Sock              |        15.00 |
|       3X4 | Treado Tire            |        30.00 |
|       4X2 | Electra Compass        |        45.00 |
|       4X3 | Mega Camera            |       275.00 |
|       4X4 | Dura Boot              |        90.00 |
|       8X8 | Power Pedals           |        20.00 |
|       9X9 | Trusty Rope            |        30.00 |

The solution and its results:

#+BEGIN_SRC sql
SELECT p.productid, productname, productprice
FROM product p, soldvia s
WHERE p.productid = s.productid
GROUP BY p.productid, p.productname, p.productprice
HAVING SUM(s.noofitems) > 3;
#+END_SRC

#+RESULTS:
| productid | productname            | productprice |
|-----------+------------------------+--------------|
|       1X2 | Comfy Harness          |       150.00 |
|       1X4 | Safe-T Helmet          |        40.00 |
|       2X1 | Mmm Stove              |        80.00 |
|       2X2 | Easy Boot              |        70.00 |
|       2X3 | Reflect-o Jacket       |        35.00 |
|       2X4 | Strongster Carribeaner |        20.00 |
|       3X1 | Sleepy Pad             |        25.00 |
|       3X3 | Cosy Sock              |        15.00 |
|       3X4 | Treado Tire            |        30.00 |
|       4X2 | Electra Compass        |        45.00 |
|       4X3 | Mega Camera            |       275.00 |
|       4X4 | Dura Boot              |        90.00 |
|       8X8 | Power Pedals           |        20.00 |
|       9X9 | Trusty Rope            |        30.00 |


*** ALternative 1

#+BEGIN_SRC sql
SELECT p.productid, p.productname, p.productprice 
FROM product p
INNER JOIN soldvia s
ON p.productid = s.productid
GROUP BY p.productid
HAVING SUM(s.noofitems) >3;
#+END_SRC

#+RESULTS:
| productid | productname            | productprice |
|-----------+------------------------+--------------|
|       1X2 | Comfy Harness          |       150.00 |
|       1X4 | Safe-T Helmet          |        40.00 |
|       2X1 | Mmm Stove              |        80.00 |
|       2X2 | Easy Boot              |        70.00 |
|       2X3 | Reflect-o Jacket       |        35.00 |
|       2X4 | Strongster Carribeaner |        20.00 |
|       3X1 | Sleepy Pad             |        25.00 |
|       3X3 | Cosy Sock              |        15.00 |
|       3X4 | Treado Tire            |        30.00 |
|       4X2 | Electra Compass        |        45.00 |
|       4X3 | Mega Camera            |       275.00 |
|       4X4 | Dura Boot              |        90.00 |
|       8X8 | Power Pedals           |        20.00 |
|       9X9 | Trusty Rope            |        30.00 |



*** qualified name

#+BEGIN_SRC sql
SELECT p.productid, p.productname, p.productprice 
FROM product p, soldvia s
WHERE p.productid = s.productid
GROUP BY productid
HAVING SUM(s.noofitems) >3;
#+END_SRC

#+RESULTS:
| productid | productname            | productprice |
|-----------+------------------------+--------------|
|       1X2 | Comfy Harness          |       150.00 |
|       1X4 | Safe-T Helmet          |        40.00 |
|       2X1 | Mmm Stove              |        80.00 |
|       2X2 | Easy Boot              |        70.00 |
|       2X3 | Reflect-o Jacket       |        35.00 |
|       2X4 | Strongster Carribeaner |        20.00 |
|       3X1 | Sleepy Pad             |        25.00 |
|       3X3 | Cosy Sock              |        15.00 |
|       3X4 | Treado Tire            |        30.00 |
|       4X2 | Electra Compass        |        45.00 |
|       4X3 | Mega Camera            |       275.00 |
|       4X4 | Dura Boot              |        90.00 |
|       8X8 | Power Pedals           |        20.00 |
|       9X9 | Trusty Rope            |        30.00 |

* Problem 4

Consider the ER diagram and relational schema for the HAFH Realty
Company Property Management Database in Figures 5.39a and 5.39b on
pages 158 and 159 in your text.  Write the SQL queries that accomplish
the following tasks:

** Part 1

Display the MFName, MLNames, MSalary, MBdate, and number of buildings
that the manager manages for all managers with a salary less than
$55,000.  (10 points)

/This is problem E5.2d in the text./

#+BEGIN_SRC sql :engine mysql
SELECT m.mfname, m.mlname, m.msalary, m.mbdate, count(*)
FROM building b, manager m
WHERE b.bmanagerid = m.managerid 
AND m.msalary < 55000
GROUP BY m.mfname, m.mlname, m.msalary, m.mbdate;
#+END_SRC

#+RESULTS:
| mfname  | mlname   |  msalary |     mbdate | count(*) |
|---------+----------+----------+------------+----------|
| Austin  | Lee      | 50000.00 | 1975-10-30 |        2 |
| George  | Sherman  | 52000.00 | 1976-01-11 |        1 |
| Mariana | Gonzalez | 54000.00 | 1980-12-27 |        2 |

*** Alternative 1

#+BEGIN_SRC sql :engine mysql
SELECT m.mfname, m.mlname, m.msalary, m.mbdate, count(b.buildingid)
FROM manager m
INNER JOIN building b
ON b.bmanagerid = m.managerid 
WHERE m.msalary < 55000
GROUP BY m.managerid;
#+END_SRC

#+RESULTS:
| mfname  | mlname   |  msalary |     mbdate | count(b.buildingid) |
|---------+----------+----------+------------+---------------------|
| Austin  | Lee      | 50000.00 | 1975-10-30 |                   2 |
| George  | Sherman  | 52000.00 | 1976-01-11 |                   1 |
| Mariana | Gonzalez | 54000.00 | 1980-12-27 |                   2 |


