public_html/midterm.html

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Part 3</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Rewrite Query 29 on page 147 using a join statement (no nested
queries).  
(10 points)
</p>

<p>
<i>This is exercise 5.1o from the textbook.</i>
</p>

<p>
The query text:
</p>

<p>
<i>For each product that has more than three items sold within all sales
transactions, retrieve the product ID, product name and product price.</i>
</p>

<p>
The original query and its results:
</p>

<div class="org-src-container">

<pre class="src src-sql">SELECT productid, productname, productprice 
FROM product 
WHERE productid IN (
  SELECT productid 
  FROM soldvia 
  GROUP BY productid 
  HAVING SUM(noofitems) &gt; 3);
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="right"/>

<col class="left"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="right">productid</th>
<th scope="col" class="left">productname</th>
<th scope="col" class="right">productprice</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1X2</td>
<td class="left">Comfy Harness</td>
<td class="right">150.00</td>
</tr>

<tr>
<td class="right">1X4</td>
<td class="left">Safe-T Helmet</td>
<td class="right">40.00</td>
</tr>

<tr>
<td class="right">2X1</td>
<td class="left">Mmm Stove</td>
<td class="right">80.00</td>
</tr>

<tr>
<td class="right">2X2</td>
<td class="left">Easy Boot</td>
<td class="right">70.00</td>
</tr>

<tr>
<td class="right">2X3</td>
<td class="left">Reflect-o Jacket</td>
<td class="right">35.00</td>
</tr>

<tr>
<td class="right">2X4</td>
<td class="left">Strongster Carribeaner</td>
<td class="right">20.00</td>
</tr>

<tr>
<td class="right">3X1</td>
<td class="left">Sleepy Pad</td>
<td class="right">25.00</td>
</tr>

<tr>
<td class="right">3X3</td>
<td class="left">Cosy Sock</td>
<td class="right">15.00</td>
</tr>

<tr>
<td class="right">3X4</td>
<td class="left">Treado Tire</td>
<td class="right">30.00</td>
</tr>

<tr>
<td class="right">4X2</td>
<td class="left">Electra Compass</td>
<td class="right">45.00</td>
</tr>

<tr>
<td class="right">4X3</td>
<td class="left">Mega Camera</td>
<td class="right">275.00</td>
</tr>

<tr>
<td class="right">4X4</td>
<td class="left">Dura Boot</td>
<td class="right">90.00</td>
</tr>

<tr>
<td class="right">8X8</td>
<td class="left">Power Pedals</td>
<td class="right">20.00</td>
</tr>

<tr>
<td class="right">9X9</td>
<td class="left">Trusty Rope</td>
<td class="right">30.00</td>
</tr>
</tbody>
</table>

<p>
The solution and its results:
</p>

<div class="org-src-container">

<pre class="src src-sql">SELECT p.productid, productname, productprice
FROM product p, soldvia s
WHERE p.productid = s.productid
GROUP BY p.productid, p.productname, p.productprice
HAVING SUM(s.noofitems) &gt; 3;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="right"/>

<col class="left"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="right">productid</th>
<th scope="col" class="left">productname</th>
<th scope="col" class="right">productprice</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1X2</td>
<td class="left">Comfy Harness</td>
<td class="right">150.00</td>
</tr>

<tr>
<td class="right">1X4</td>
<td class="left">Safe-T Helmet</td>
<td class="right">40.00</td>
</tr>

<tr>
<td class="right">2X1</td>
<td class="left">Mmm Stove</td>
<td class="right">80.00</td>
</tr>

<tr>
<td class="right">2X2</td>
<td class="left">Easy Boot</td>
<td class="right">70.00</td>
</tr>

<tr>
<td class="right">2X3</td>
<td class="left">Reflect-o Jacket</td>
<td class="right">35.00</td>
</tr>

<tr>
<td class="right">2X4</td>
<td class="left">Strongster Carribeaner</td>
<td class="right">20.00</td>
</tr>

<tr>
<td class="right">3X1</td>
<td class="left">Sleepy Pad</td>
<td class="right">25.00</td>
</tr>

<tr>
<td class="right">3X3</td>
<td class="left">Cosy Sock</td>
<td class="right">15.00</td>
</tr>

<tr>
<td class="right">3X4</td>
<td class="left">Treado Tire</td>
<td class="right">30.00</td>
</tr>

<tr>
<td class="right">4X2</td>
<td class="left">Electra Compass</td>
<td class="right">45.00</td>
</tr>

<tr>
<td class="right">4X3</td>
<td class="left">Mega Camera</td>
<td class="right">275.00</td>
</tr>

<tr>
<td class="right">4X4</td>
<td class="left">Dura Boot</td>
<td class="right">90.00</td>
</tr>

<tr>
<td class="right">8X8</td>
<td class="left">Power Pedals</td>
<td class="right">20.00</td>
</tr>

<tr>
<td class="right">9X9</td>
<td class="left">Trusty Rope</td>
<td class="right">30.00</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">ALternative 1</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">

<pre class="src src-sql">SELECT p.productid, p.productname, p.productprice 
FROM product p
INNER JOIN soldvia s
ON p.productid = s.productid
GROUP BY p.productid
HAVING SUM(s.noofitems) &gt;3;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="right"/>

<col class="left"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="right">productid</th>
<th scope="col" class="left">productname</th>
<th scope="col" class="right">productprice</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1X2</td>
<td class="left">Comfy Harness</td>
<td class="right">150.00</td>
</tr>

<tr>
<td class="right">1X4</td>
<td class="left">Safe-T Helmet</td>
<td class="right">40.00</td>
</tr>

<tr>
<td class="right">2X1</td>
<td class="left">Mmm Stove</td>
<td class="right">80.00</td>
</tr>

<tr>
<td class="right">2X2</td>
<td class="left">Easy Boot</td>
<td class="right">70.00</td>
</tr>

<tr>
<td class="right">2X3</td>
<td class="left">Reflect-o Jacket</td>
<td class="right">35.00</td>
</tr>

<tr>
<td class="right">2X4</td>
<td class="left">Strongster Carribeaner</td>
<td class="right">20.00</td>
</tr>

<tr>
<td class="right">3X1</td>
<td class="left">Sleepy Pad</td>
<td class="right">25.00</td>
</tr>

<tr>
<td class="right">3X3</td>
<td class="left">Cosy Sock</td>
<td class="right">15.00</td>
</tr>

<tr>
<td class="right">3X4</td>
<td class="left">Treado Tire</td>
<td class="right">30.00</td>
</tr>

<tr>
<td class="right">4X2</td>
<td class="left">Electra Compass</td>
<td class="right">45.00</td>
</tr>

<tr>
<td class="right">4X3</td>
<td class="left">Mega Camera</td>
<td class="right">275.00</td>
</tr>

<tr>
<td class="right">4X4</td>
<td class="left">Dura Boot</td>
<td class="right">90.00</td>
</tr>

<tr>
<td class="right">8X8</td>
<td class="left">Power Pedals</td>
<td class="right">20.00</td>
</tr>

<tr>
<td class="right">9X9</td>
<td class="left">Trusty Rope</td>
<td class="right">30.00</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Problem 4</h2>
<div class="outline-text-2" id="text-3">
<p>
Consider the ER diagram and relational schema for the HAFH Realty
Company Property Management Database in Figures 5.39a and 5.39b on
pages 158 and 159 in your text.  Write the SQL queries that accomplish
the following tasks:
</p>
</div>


<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Part 1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Display the MFName, MLNames, MSalary, MBdate, and number of buildings
that the manager manages for all managers with a salary less than
$55,000.  (10 points)
</p>

<p>
<i>This is problem E5.2d in the text.</i>
</p>

<div class="org-src-container">

<pre class="src src-sql">SELECT m.mfname, m.mlname, m.msalary, m.mbdate, count(*)
FROM building b, manager m
WHERE b.bmanagerid = m.managerid 
AND m.msalary &lt; 55000
GROUP BY m.mfname, m.mlname, m.msalary, m.mbdate;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="right"/>

<col class="right"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">mfname</th>
<th scope="col" class="left">mlname</th>
<th scope="col" class="right">msalary</th>
<th scope="col" class="right">mbdate</th>
<th scope="col" class="right">count(*)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Austin</td>
<td class="left">Lee</td>
<td class="right">50000.00</td>
<td class="right">1975-10-30</td>
<td class="right">2</td>
</tr>

<tr>
<td class="left">George</td>
<td class="left">Sherman</td>
<td class="right">52000.00</td>
<td class="right">1976-01-11</td>
<td class="right">1</td>
</tr>

<tr>
<td class="left">Mariana</td>
<td class="left">Gonzalez</td>
<td class="right">54000.00</td>
<td class="right">1980-12-27</td>
<td class="right">2</td>
</tr>
</tbody>
</table>
</div>
