midterm.org
*** Alternative 2

#+BEGIN_SRC sql :engine mysql
SELECT m.mfname, m.mlname, m.msalary, m.mbdate, 
  count( 
    SELECT * 
    FROM building b,manager m 
    WHERE b.bmanagerid = m.managerid) AS mbuildingcount
FROM manager m
-- INNER JOIN building b
-- ON b.bmanagerid = m.managerid 
WHERE m.msalary < 55000;
-- GROUP BY m.managerid;
#+END_SRC

#+RESULTS:

#+BEGIN_EXAMPLE
ERROR 1064 (42000) at line 1: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'SELECT * 
    FROM building b,manager m 
    WHERE b.bmanagerid = m.managerid) A' at line 3
#+END_EXAMPLE

*** Alternative 3

#+BEGIN_SRC sql :engine mysql
SELECT m.mfname, m.mlname, m.msalary, m.mbdate, count(*)
FROM building b, manager m
WHERE b.bmanagerid = m.managerid 
AND m.msalary < 55000
-- GROUP BY m.mfname, m.mlname, m.msalary, m.mbdate;
GROUP BY m.managerid;
#+END_SRC

#+RESULTS:
| mfname  | mlname   |  msalary |     mbdate | count(*) |
|---------+----------+----------+------------+----------|
| Austin  | Lee      | 50000.00 | 1975-10-30 |        2 |
| George  | Sherman  | 52000.00 | 1976-01-11 |        1 |
| Mariana | Gonzalez | 54000.00 | 1980-12-27 |        2 |

*** Alternative 4

#+BEGIN_SRC sql :engine mysql
SELECT m.mfname, m.mlname, m.msalary, m.mbdate, count(b.buildingid)
FROM manager m
INNER JOIN building b
ON b.bmanagerid = m.managerid 
GROUP BY m.managerid
WHERE m.msalary < 55000;
#+END_SRC

#+RESULTS:


#+BEGIN_SRC sql :engine mysql
SELECT mfname, mlname, msalary, mbdate, count(*)
FROM building, manager 
WHERE mresbuildingid = buildingid
AND msalary < 55000
GROUP BY managerid;
#+END_SRC

#+RESULTS:
| mfname  | mlname   |  msalary |     mbdate | count(*) |
|---------+----------+----------+------------+----------|
| Austin  | Lee      | 50000.00 | 1975-10-30 |        1 |
| George  | Sherman  | 52000.00 | 1976-01-11 |        1 |
| Mariana | Gonzalez | 54000.00 | 1980-12-27 |        1 |


