public_html/midterm.html


<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">Alternative 1</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">

<pre class="src src-sql">SELECT m.mfname, m.mlname, m.msalary, m.mbdate, count(b.buildingid)
FROM manager m
INNER JOIN building b
ON b.bmanagerid = m.managerid 
WHERE m.msalary &lt; 55000
GROUP BY m.managerid;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="right"/>

<col class="right"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">mfname</th>
<th scope="col" class="left">mlname</th>
<th scope="col" class="right">msalary</th>
<th scope="col" class="right">mbdate</th>
<th scope="col" class="right">count(b.buildingid)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Austin</td>
<td class="left">Lee</td>
<td class="right">50000.00</td>
<td class="right">1975-10-30</td>
<td class="right">2</td>
</tr>

<tr>
<td class="left">George</td>
<td class="left">Sherman</td>
<td class="right">52000.00</td>
<td class="right">1976-01-11</td>
<td class="right">1</td>
</tr>

<tr>
<td class="left">Mariana</td>
<td class="left">Gonzalez</td>
<td class="right">54000.00</td>
<td class="right">1980-12-27</td>
<td class="right">2</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">Alternative 2</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">

<pre class="src src-sql">SELECT m.mfname, m.mlname, m.msalary, m.mbdate, 
  count( 
    SELECT * 
    FROM building b,manager m 
    WHERE b.bmanagerid = m.managerid) AS mbuildingcount
FROM manager m
-- INNER JOIN building b
-- ON b.bmanagerid = m.managerid 
WHERE m.msalary &lt; 55000;
-- GROUP BY m.managerid;
</pre>
</div>

<pre class="example">
ERROR 1064 (42000) at line 1: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'SELECT * 
    FROM building b,manager m 
    WHERE b.bmanagerid = m.managerid) A' at line 3
</pre>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">Alternative 3</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">

<pre class="src src-sql">SELECT m.mfname, m.mlname, m.msalary, m.mbdate, count(*)
FROM building b, manager m
WHERE b.bmanagerid = m.managerid 
AND m.msalary &lt; 55000
-- GROUP BY m.mfname, m.mlname, m.msalary, m.mbdate;
GROUP BY m.managerid;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="right"/>

<col class="right"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">mfname</th>
<th scope="col" class="left">mlname</th>
<th scope="col" class="right">msalary</th>
<th scope="col" class="right">mbdate</th>
<th scope="col" class="right">count(*)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Austin</td>
<td class="left">Lee</td>
<td class="right">50000.00</td>
<td class="right">1975-10-30</td>
<td class="right">2</td>
</tr>

<tr>
<td class="left">George</td>
<td class="left">Sherman</td>
<td class="right">52000.00</td>
<td class="right">1976-01-11</td>
<td class="right">1</td>
</tr>

<tr>
<td class="left">Mariana</td>
<td class="left">Gonzalez</td>
<td class="right">54000.00</td>
<td class="right">1980-12-27</td>
<td class="right">2</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4">Alternative 4</h4>
<div class="outline-text-4" id="text-3-1-4">
<div class="org-src-container">

<pre class="src src-sql">SELECT m.mfname, m.mlname, m.msalary, m.mbdate, count(b.buildingid)
FROM manager m
INNER JOIN building b
ON b.bmanagerid = m.managerid 
GROUP BY m.managerid
WHERE m.msalary &lt; 55000;
</pre>
</div>

<pre class="example">
ERROR 1064 (42000) at line 1: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'WHERE m.msalary &lt; 55000' at line 6
</pre>

<div class="org-src-container">

<pre class="src src-sql">SELECT mfname, mlname, msalary, mbdate, count(*)
FROM building, manager 
WHERE mresbuildingid = buildingid
AND msalary &lt; 55000
GROUP BY managerid;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="right"/>

<col class="right"/>

<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">mfname</th>
<th scope="col" class="left">mlname</th>
<th scope="col" class="right">msalary</th>
<th scope="col" class="right">mbdate</th>
<th scope="col" class="right">count(*)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Austin</td>
<td class="left">Lee</td>
<td class="right">50000.00</td>
<td class="right">1975-10-30</td>
<td class="right">1</td>
</tr>

<tr>
<td class="left">George</td>
<td class="left">Sherman</td>
<td class="right">52000.00</td>
<td class="right">1976-01-11</td>
<td class="right">1</td>
</tr>

<tr>
<td class="left">Mariana</td>
<td class="left">Gonzalez</td>
<td class="right">54000.00</td>
<td class="right">1980-12-27</td>
<td class="right">1</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
