midterm.org
** Part 2

Display complete records of any corporate clients that have both been
referred by another client and in turn referred additional clients.
(10 points)

/This is another example of a unary relationship, much like the
example from figures 3.47 and 3.48 on page 75 in the text, except that
all of the data we need is in one table.  See also [[https://piazza.com/class#spring2013/cspp53001/37][Piazza post @37]]./

Compare the structure of the example we discussed:

#+BEGIN_SRC sql :engine mysql
SELECT
 advisor.EmpName AS AdvisorName,
 advisee.EmpName AS AdviseeName
FROM advising
JOIN employee AS advisor
ON Advisor = advisor.EmpID
JOIN employee AS advisee
ON Advisee = advisee.EmpID
WHERE advisor.EmpName = "Becky";
#+END_SRC

to this query that solves the problem:

#+Begin_SRC sql :engine mysql
SELECT self.*
FROM corpclient AS self
JOIN corpclient AS referrer
ON self.ccidreferredby = referrer.ccid 
JOIN corpclient AS referred
ON self.ccid = referred.ccidreferredby;
#+END_SRC

#+RESULTS:
| ccid | ccname   | ccindustry   | cclocation | ccidreferredby |
|------+----------+--------------+------------+----------------|
| C222 | SkyJet   | Airline      | Oak Park   | C111           |
| C444 | NanoCorp | Broadcasting | Rosemont   | C111           |
| C777 | WindyCT  | Music        | Chicago    | C222           |

To check this result we can inspect the related records either by
expanding the =SELECT= clause or through the use of subqueries.

#+BEGIN_SRC sql :engine mysql
SELECT *
FROM corpclient AS self
JOIN corpclient AS referrer
ON self.ccidreferredby = referrer.ccid 
JOIN corpclient AS referred
ON self.ccid = referred.ccidreferredby;
#+END_SRC

#+RESULTS:
| ccid | ccname   | ccindustry   | cclocation | ccidreferredby | ccid | ccname     | ccindustry | cclocation | ccidreferredby | ccid | ccname    | ccindustry   | cclocation | ccidreferredby |
|------+----------+--------------+------------+----------------+------+------------+------------+------------+----------------+------+-----------+--------------+------------+----------------|
| C444 | NanoCorp | Broadcasting | Rosemont   | C111           | C111 | BlingNotes | Music      | Chicago    | NULL           | C666 | DelishInc | Food Service | Oak Brook  | C444           |
| C222 | SkyJet   | Airline      | Oak Park   | C111           | C111 | BlingNotes | Music      | Chicago    | NULL           | C777 | WindyCT   | Music        | Chicago    | C222           |
| C777 | WindyCT  | Music        | Chicago    | C222           | C222 | SkyJet     | Airline    | Oak Park   | C111           | C888 | SouthAlps | Sports       | Rosemont   | C777           |


#+BEGIN_SRC sql :engine mysql
SELECT *
FROM corpclient
WHERE ccidreferredby IN (
  SELECT self.ccid
  FROM corpclient AS self
  JOIN corpclient AS referrer
  ON self.ccidreferredby = referrer.ccid 
  JOIN corpclient AS referred
  ON self.ccid = referred.ccidreferredby);
#+END_SRC

#+RESULTS:
| ccid | ccname    | ccindustry   | cclocation | ccidreferredby |
|------+-----------+--------------+------------+----------------|
| C666 | DelishInc | Food Service | Oak Brook  | C444           |
| C777 | WindyCT   | Music        | Chicago    | C222           |
| C888 | SouthAlps | Sports       | Rosemont   | C777           |

#+BEGIN_SRC sql :engine mysql
SELECT *
FROM corpclient
WHERE ccid IN (
  SELECT self.ccidreferredby
  FROM corpclient AS self
  JOIN corpclient AS referrer
  ON self.ccidreferredby = referrer.ccid 
  JOIN corpclient AS referred
  ON self.ccid = referred.ccidreferredby);
#+END_SRC

#+RESULTS:
| ccid | ccname     | ccindustry | cclocation | ccidreferredby |
|------+------------+------------+------------+----------------|
| C111 | BlingNotes | Music      | Chicago    | NULL           |
| C222 | SkyJet     | Airline    | Oak Park   | C111           |



*** Alternative 1

#+BEGIN_SRC sql
SELECT * 
FROM corpclient a
WHERE ccidreferredby IS NOT NULL
AND EXISTS (
  SELECT ccidreferredby
  FROM corpclient b
  WHERE b.ccidreferredby = a.ccid);
#+END_SRC

#+RESULTS:
| ccid | ccname   | ccindustry   | cclocation | ccidreferredby |
|------+----------+--------------+------------+----------------|
| C222 | SkyJet   | Airline      | Oak Park   | C111           |
| C444 | NanoCorp | Broadcasting | Rosemont   | C111           |
| C777 | WindyCT  | Music        | Chicago    | C222           |



*** Alternative 2

#+BEGIN_SRC sql
SELECT c2.*
FROM corpclient c1, corpclient c2, corpclient c3
WHERE c1.ccidreferredby = c2.ccid
AND c2.ccidreferredby = c3.ccid;
#+END_SRC

#+RESULTS:
| ccid | ccname   | ccindustry   | cclocation | ccidreferredby |
|------+----------+--------------+------------+----------------|
| C222 | SkyJet   | Airline      | Oak Park   | C111           |
| C444 | NanoCorp | Broadcasting | Rosemont   | C111           |
| C777 | WindyCT  | Music        | Chicago    | C222           |


