public_html/midterm.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Part 2</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Display complete records of any corporate clients that have both been
referred by another client and in turn referred additional clients.
(10 points)
</p>

<p>
/This is another example of a unary relationship, much like the
example from figures 3.47 and 3.48 on page 75 in the text, except that
all of the data we need is in one table.  See also <a href="https://piazza.com/class#spring2013/cspp53001/37">Piazza post @37</a>./
</p>

<p>
Compare the structure of the example we discussed:
</p>

<div class="org-src-container">

<pre class="src src-sql">SELECT
 advisor.EmpName AS AdvisorName,
 advisee.EmpName AS AdviseeName
FROM advising
JOIN employee AS advisor
ON Advisor = advisor.EmpID
JOIN employee AS advisee
ON Advisee = advisee.EmpID
WHERE advisor.EmpName = "Becky";
</pre>
</div>

<p>
to this query that solves the problem:
</p>

<div class="org-src-container">

<pre class="src src-sql">SELECT self.*
FROM corpclient AS self
JOIN corpclient AS referrer
ON self.ccidreferredby = referrer.ccid 
JOIN corpclient AS referred
ON self.ccid = referred.ccidreferredby;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">ccid</th>
<th scope="col" class="left">ccname</th>
<th scope="col" class="left">ccindustry</th>
<th scope="col" class="left">cclocation</th>
<th scope="col" class="left">ccidreferredby</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C222</td>
<td class="left">SkyJet</td>
<td class="left">Airline</td>
<td class="left">Oak Park</td>
<td class="left">C111</td>
</tr>

<tr>
<td class="left">C444</td>
<td class="left">NanoCorp</td>
<td class="left">Broadcasting</td>
<td class="left">Rosemont</td>
<td class="left">C111</td>
</tr>

<tr>
<td class="left">C777</td>
<td class="left">WindyCT</td>
<td class="left">Music</td>
<td class="left">Chicago</td>
<td class="left">C222</td>
</tr>
</tbody>
</table>

<p>
To check this result we can inspect the related records either by
expanding the <code>SELECT</code> clause or through the use of subqueries.
</p>

<div class="org-src-container">

<pre class="src src-sql">SELECT *
FROM corpclient AS self
JOIN corpclient AS referrer
ON self.ccidreferredby = referrer.ccid 
JOIN corpclient AS referred
ON self.ccid = referred.ccidreferredby;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">ccid</th>
<th scope="col" class="left">ccname</th>
<th scope="col" class="left">ccindustry</th>
<th scope="col" class="left">cclocation</th>
<th scope="col" class="left">ccidreferredby</th>
<th scope="col" class="left">ccid</th>
<th scope="col" class="left">ccname</th>
<th scope="col" class="left">ccindustry</th>
<th scope="col" class="left">cclocation</th>
<th scope="col" class="left">ccidreferredby</th>
<th scope="col" class="left">ccid</th>
<th scope="col" class="left">ccname</th>
<th scope="col" class="left">ccindustry</th>
<th scope="col" class="left">cclocation</th>
<th scope="col" class="left">ccidreferredby</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C444</td>
<td class="left">NanoCorp</td>
<td class="left">Broadcasting</td>
<td class="left">Rosemont</td>
<td class="left">C111</td>
<td class="left">C111</td>
<td class="left">BlingNotes</td>
<td class="left">Music</td>
<td class="left">Chicago</td>
<td class="left">NULL</td>
<td class="left">C666</td>
<td class="left">DelishInc</td>
<td class="left">Food Service</td>
<td class="left">Oak Brook</td>
<td class="left">C444</td>
</tr>

<tr>
<td class="left">C222</td>
<td class="left">SkyJet</td>
<td class="left">Airline</td>
<td class="left">Oak Park</td>
<td class="left">C111</td>
<td class="left">C111</td>
<td class="left">BlingNotes</td>
<td class="left">Music</td>
<td class="left">Chicago</td>
<td class="left">NULL</td>
<td class="left">C777</td>
<td class="left">WindyCT</td>
<td class="left">Music</td>
<td class="left">Chicago</td>
<td class="left">C222</td>
</tr>

<tr>
<td class="left">C777</td>
<td class="left">WindyCT</td>
<td class="left">Music</td>
<td class="left">Chicago</td>
<td class="left">C222</td>
<td class="left">C222</td>
<td class="left">SkyJet</td>
<td class="left">Airline</td>
<td class="left">Oak Park</td>
<td class="left">C111</td>
<td class="left">C888</td>
<td class="left">SouthAlps</td>
<td class="left">Sports</td>
<td class="left">Rosemont</td>
<td class="left">C777</td>
</tr>
</tbody>
</table>


<div class="org-src-container">

<pre class="src src-sql">SELECT *
FROM corpclient
WHERE ccidreferredby IN (
  SELECT self.ccid
  FROM corpclient AS self
  JOIN corpclient AS referrer
  ON self.ccidreferredby = referrer.ccid 
  JOIN corpclient AS referred
  ON self.ccid = referred.ccidreferredby);
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">ccid</th>
<th scope="col" class="left">ccname</th>
<th scope="col" class="left">ccindustry</th>
<th scope="col" class="left">cclocation</th>
<th scope="col" class="left">ccidreferredby</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C666</td>
<td class="left">DelishInc</td>
<td class="left">Food Service</td>
<td class="left">Oak Brook</td>
<td class="left">C444</td>
</tr>

<tr>
<td class="left">C777</td>
<td class="left">WindyCT</td>
<td class="left">Music</td>
<td class="left">Chicago</td>
<td class="left">C222</td>
</tr>

<tr>
<td class="left">C888</td>
<td class="left">SouthAlps</td>
<td class="left">Sports</td>
<td class="left">Rosemont</td>
<td class="left">C777</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-sql">SELECT *
FROM corpclient
WHERE ccid IN (
  SELECT self.ccidreferredby
  FROM corpclient AS self
  JOIN corpclient AS referrer
  ON self.ccidreferredby = referrer.ccid 
  JOIN corpclient AS referred
  ON self.ccid = referred.ccidreferredby);
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">ccid</th>
<th scope="col" class="left">ccname</th>
<th scope="col" class="left">ccindustry</th>
<th scope="col" class="left">cclocation</th>
<th scope="col" class="left">ccidreferredby</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C111</td>
<td class="left">BlingNotes</td>
<td class="left">Music</td>
<td class="left">Chicago</td>
<td class="left">NULL</td>
</tr>

<tr>
<td class="left">C222</td>
<td class="left">SkyJet</td>
<td class="left">Airline</td>
<td class="left">Oak Park</td>
<td class="left">C111</td>
</tr>
</tbody>
</table>
</div>



<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">Alternative 1</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">

<pre class="src src-sql">SELECT * 
FROM corpclient a
WHERE ccidreferredby IS NOT NULL
AND EXISTS (
  SELECT ccidreferredby
  FROM corpclient b
  WHERE b.ccidreferredby = a.ccid);
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">ccid</th>
<th scope="col" class="left">ccname</th>
<th scope="col" class="left">ccindustry</th>
<th scope="col" class="left">cclocation</th>
<th scope="col" class="left">ccidreferredby</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C222</td>
<td class="left">SkyJet</td>
<td class="left">Airline</td>
<td class="left">Oak Park</td>
<td class="left">C111</td>
</tr>

<tr>
<td class="left">C444</td>
<td class="left">NanoCorp</td>
<td class="left">Broadcasting</td>
<td class="left">Rosemont</td>
<td class="left">C111</td>
</tr>

<tr>
<td class="left">C777</td>
<td class="left">WindyCT</td>
<td class="left">Music</td>
<td class="left">Chicago</td>
<td class="left">C222</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2">Alternative 2</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">

<pre class="src src-sql">SELECT c2.*
FROM corpclient c1, corpclient c2, corpclient c3
WHERE c1.ccidreferredby = c2.ccid
AND c2.ccidreferredby = c3.ccid;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">ccid</th>
<th scope="col" class="left">ccname</th>
<th scope="col" class="left">ccindustry</th>
<th scope="col" class="left">cclocation</th>
<th scope="col" class="left">ccidreferredby</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C222</td>
<td class="left">SkyJet</td>
<td class="left">Airline</td>
<td class="left">Oak Park</td>
<td class="left">C111</td>
</tr>

<tr>
<td class="left">C444</td>
<td class="left">NanoCorp</td>
<td class="left">Broadcasting</td>
<td class="left">Rosemont</td>
<td class="left">C111</td>
</tr>

<tr>
<td class="left">C777</td>
<td class="left">WindyCT</td>
<td class="left">Music</td>
<td class="left">Chicago</td>
<td class="left">C222</td>
</tr>
</tbody>
</table>
</div>
</div>
