midterm.org
*** Alternative 3

#+BEGIN_SRC sql
SELECT *
FROM corpclient c1
WHERE EXISTS (
  SELECT 1
  FROM corpclient c2
  WHERE c1.ccid = c2.ccidreferredby)
AND EXISTS (
  SELECT 1
  FROM corpclient c3
  WHERE c1.ccidreferredby = c3.ccid);
#+END_SRC

#+RESULTS:
| ccid | ccname   | ccindustry   | cclocation | ccidreferredby |
|------+----------+--------------+------------+----------------|
| C222 | SkyJet   | Airline      | Oak Park   | C111           |
| C444 | NanoCorp | Broadcasting | Rosemont   | C111           |
| C777 | WindyCT  | Music        | Chicago    | C222           |



*** Alternative 4

#+BEGIN_SRC sql
SELECT referred.*
FROM corpclient referred, corpclient referrer
WHERE referred.ccid = referrer.ccidreferredby
AND referred.ccidreferredby IS NOT NULL;
#+END_SRC

#+RESULTS:
| ccid | ccname   | ccindustry   | cclocation | ccidreferredby |
|------+----------+--------------+------------+----------------|
| C222 | SkyJet   | Airline      | Oak Park   | C111           |
| C444 | NanoCorp | Broadcasting | Rosemont   | C111           |
| C777 | WindyCT  | Music        | Chicago    | C222           |

*** Alternative 5

#+BEGIN_SRC sql
SELECT *
FROM corpclient
WHERE ccid IN (
  SELECT ccidreferredby
  FROM corpclient)
AND ccidreferredby IS NOT NULL;
#+END_SRC

#+RESULTS:
| ccid | ccname   | ccindustry   | cclocation | ccidreferredby |
|------+----------+--------------+------------+----------------|
| C222 | SkyJet   | Airline      | Oak Park   | C111           |
| C444 | NanoCorp | Broadcasting | Rosemont   | C111           |
| C777 | WindyCT  | Music        | Chicago    | C222           |


*** Alternative 6

#+BEGIN_SRC sql
SELECT cc2.*
FROM corpclient cc1, corpclient cc2
WHERE cc1.ccidreferredby = cc2.ccid
AND cc2.ccidreferredby IS NOT NULL;
#+END_SRC

#+RESULTS:
| ccid | ccname   | ccindustry   | cclocation | ccidreferredby |
|------+----------+--------------+------------+----------------|
| C222 | SkyJet   | Airline      | Oak Park   | C111           |
| C444 | NanoCorp | Broadcasting | Rosemont   | C111           |
| C777 | WindyCT  | Music        | Chicago    | C222           |



*** Alternative 7 -- not quite right!

#+BEGIN_SRC sql
SELECT *
FROM corpclient
WHERE ccid IN (
  SELECT c.ccid
  FROM corpclient c
  JOIN corpclient r
  ON c.ccid = r.ccidreferredby);
#+END_SRC

#+RESULTS:
| ccid | ccname     | ccindustry   | cclocation | ccidreferredby |
|------+------------+--------------+------------+----------------|
| C111 | BlingNotes | Music        | Chicago    | NULL           |
| C222 | SkyJet     | Airline      | Oak Park   | C111           |
| C444 | NanoCorp   | Broadcasting | Rosemont   | C111           |
| C777 | WindyCT    | Music        | Chicago    | C222           |

